In [1]:
import pandas as pd

In [2]:
data = [(1, 2, 3, 4),
        (5, 6, 7, 8),
        (8, 9, 10, 11),
        (13, 14, 15, 16)]
data

[(1, 2, 3, 4), (5, 6, 7, 8), (8, 9, 10, 11), (13, 14, 15, 16)]

In [5]:
df = pd.DataFrame(data, '11 12 13 14'.split(), 'c1 c2 c3 c4'.split())
df

    c1  c2  c3  c4
11   1   2   3   4
12   5   6   7   8
13   8   9  10  11
14  13  14  15  16

In [9]:
df["c1"]
type(df["c1"])

pandas.core.series.Series

In [10]:
df[["c3","c1"]]

    c3  c1
11   3   1
12   7   5
13  10   8
14  15  13

In [15]:
df[1:][['c3','c1']]

    c3  c1
12   7   5
13  10   8
14  15  13

In [16]:
df

    c1  c2  c3  c4
11   1   2   3   4
12   5   6   7   8
13   8   9  10  11
14  13  14  15  16

In [19]:
df.loc['13']

c1     8
c2     9
c3    10
c4    11
Name: 13, dtype: int64

In [20]:
df.loc[['13', '12']]

    c1  c2  c3  c4
13   8   9  10  11
12   5   6   7   8

In [22]:
df.loc['13', 'c2']

9

In [23]:
df.iloc[0, 1]

2

In [24]:
df.loc[['13','11'], ['c4','c1']]

    c4  c1
13  11   8
11   4   1

In [26]:
df.iloc[[2, 0],[3, 0]]

    c4  c1
13  11   8
11   4   1